{
  "lunarweb": {
    "short-desc": "You're here, portfolio website created with Next.js. (That's Galadriela)",
    "link-1": "Github project",
    "link-2": "Old Github front project",
    "link-3": "Old Github backend project",
    "desc-1": "I created the first version of this website with React and Express.js. However I didn't like having to host such a small and insignificant backend just to send myself some emails through contact form.",
    "desc-2": "That's why I have rewritten it using Next.js. Now I am hosting it in one place and can access backend code through Next's amazing feature: API routes.",
    "desc-3": "Another partial rewrite, this time I switched from Next's /pages router to /app router and from Emotion to Panda-CSS. Also added support for i18n."
  },
  "lunarbingo": {
    "short-desc": "A fullstack TypeScript app! Users can create bingos, share them with others and play together! App is almost complete, I just need to work a little bit more on styling before publishing it.",
    "link-1": "Github front project",
    "link-2": "Github backend project",
    "desc-1": "My friend Oanh is currently helping me with styling the website. I'll publish the app once we finish.",
    "desc-2": "I had lots of fun learning Vue and creating this website using it. It was nice to take a little breather from constant working with React."
  },
  "lunarify-react": {
    "short-desc": "This is a React app which utilizes Spotify API to show user's top listened-to artists and albums.",
    "link-1": "Github"
  },
  "lunarify-react-native": {
    "short-desc": "This is a React Native version of my Lunarify web app for Android and iOS.",
    "link-1": "Github",
    "desc-1": "Once I heard about React Native I knew I had to learn it. Creating both web and mobile apps using almost the same code base sounded amazing.",
    "desc-2": "And so I did, this is the only app I created with React Native so far, and I did not publish it due to Spotify's rigoristic rules for extending quota usage of their API.",
    "desc-3": "I hope I'll have opportunities to work with this technology professionally."
  },
  "lunarstars": {
    "short-desc": "This is a simple website which generates random pixel art images of stars and planets which you can use for your TTRPG campaign or anything else you want.",
    "link-1": "Github",
    "link-2": "App",
    "desc-1": "This is the first app I created with React. I was really excited to show it off. Unfortunately a couple of days after finishing it, the API I used for generating pictures went down."
  },
  "minos": {
    "short-desc": "ANV Production's project in which I am responsible for coding for Arduino and Raspberry Pi devices using C++ and Python. We are developing hardware and software for an IRL game based on Twine."
  },
  "amo": {
    "short-desc": "An Unreal Engine 5 project I worked on as a developer while working at Nyx VX.",
    "link-1": "Steam Page",
    "link-2": "NYX VX",
    "desc-1": "Working on this project was amazing. I never actually thought I would like game development but this opportunity at Nyx changed my mind.",
    "desc-2": "I learned tons of useful skills while creating this app, optimization techniques among them."
  },
  "timefinder": {
    "short-desc": "DiscordJS bot which allows you to create polls to choose the best time for you and your discord server friends. React frontend, NodeJS backend, MongoDB and DiscordJS."
  },
  "lunarroller": {
    "short-desc": "This is the first website I ever made. It is written in Html, CSS and Javascript only.",
    "link-1": "Github",
    "link-2": "App"
  }
}
